# RepeaterCoordinates Class

---
Represents coordinates in the array of repeating references in 0, 1, or 2 dimensions.
SystemObject Autodesk.Revit.DBRepeaterCoordinates
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RepeaterCoordinates : IDisposable

    Public Class RepeaterCoordinates
    	Implements IDisposable

    public ref class RepeaterCoordinates : IDisposable

    type RepeaterCoordinates =
        class
            interface IDisposable
        end
The RepeaterCoordinates type exposes the following members.
| Name| Description
---|---|---
| RepeaterCoordinates|  Creates zero dimensional coordinates.
| RepeaterCoordinates(Int32)|  Creates one dimensional coordinates.
| RepeaterCoordinates(Int32, Int32)|  Creates two dimensional coordinates.
Top
| Name| Description
---|---|---
| DimensionCount|  The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the RepeaterCoordinates
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetCoordinate|  Returns the coordinate in the given dimension.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace